describe("Корзина", () => {
  it("рядом со ссылкой на корзину в шапке должно отображаться количество не повторяющихся товаров в ней", () => {
    // тесты на проверку отображения количества не повторяющихся товаров в корзине рядом со ссылкой в шапке
  });

  it("должна отображаться таблица с добавленными в нее товарами", () => {
    // тесты на проверку отображения таблицы с добавленными товарами в корзине
  });

  it("для каждого товара должны отображаться название, цена, количество, стоимость, а также должна отображаться общая сумма заказа", () => {
    // тесты на проверку отображения названия, цены, количества, стоимости для каждого товара в корзине, а также отображения общей суммы заказа
  });

  it("должна быть кнопка 'очистить корзину', по нажатию на которую все товары должны удаляться", () => {
    // тесты на проверку удаления всех товаров при нажатии на кнопку "очистить корзину"
  });

  it("если корзина пустая, должна отображаться ссылка на каталог товаров", () => {
    // тесты на проверку отображения ссылки на каталог товаров, если корзина пустая
  });
});