describe("Каталог", () => {
  it("должны отображаться товары, список которых приходит с сервера", () => {
    // тесты на проверку отображения товаров из списка, полученного с сервера
  });

  it("для каждого товара должны отображаться название, цена и ссылка на страницу с подробной информацией о товаре", () => {
    // тесты на проверку отображения названия, цены и ссылки на страницу товара для каждого товара в каталоге
  });

  it("на странице с подробной информацией должны отображаться: название, описание, цена, цвет, материал и кнопка 'добавить в корзину'", () => {
    // тесты на проверку отображения на странице с подробной информацией названия, описания, цены, цвета, материала и кнопки "добавить в корзину"
  });

  it("если товар уже добавлен в корзину, в каталоге и на странице товара должно отображаться сообщение об этом", () => {
    // тесты на проверку отображения сообщения о добавлении товара в корзину на странице товара и в каталоге, если товар уже добавлен
  });

  it("если товар уже добавлен в корзину, повторное нажатие кнопки 'добавить в корзину' до��жно увеличивать его количество", () => {
    // тесты на проверку увеличения количества товара при повторном нажатии кнопки "добавить в корзину", если товар уже добавлен
  });

  it("содержимое корзины должно сохраняться между перезагрузками страницы", () => {
    // тесты на проверку сохранения содержимого корзины между перезагрузками страницы
  });
});

